---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AdvancedGlazing Properties
AdvancedGlazing Class See Also Send Feedback
---

The AdvancedGlazing type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | GlazingBackfaceCulling | The property labeled "Backface Culling" from the "AdvancedGlazing" schema. |
|  | GlazingF0 | The property labeled "Reflective Color" from the "AdvancedGlazing" schema. |
|  | GlazingTransmissionColor | The property labeled "Transmissive color" from the "AdvancedGlazing" schema. |
|  | GlazingTransmissionRoughness | The property labeled "Transmissive roughness" from the "AdvancedGlazing" schema. |
|  | SurfaceAlbedo | The property labeled "Color" from the "AdvancedGlazing" schema. |
|  | SurfaceAnisotropy | The property labeled "Anisotropy" from the "AdvancedGlazing" schema. |
|  | SurfaceCutout | The property labeled "Image" from the "AdvancedGlazing" schema. |
|  | SurfaceNdfType | The property labeled "NDF" from the "AdvancedGlazing" schema. |
|  | SurfaceNormal | The property labeled "Image" from the "AdvancedGlazing" schema. |
|  | SurfaceRotation | The property labeled "Rotation" from the "AdvancedGlazing" schema. |
|  | SurfaceRoughness | The property labeled "Roughness" from the "AdvancedGlazing" schema. |

# See Also

AdvancedGlazing Class

Autodesk.Revit.DB.Visual Namespace